backend/app/controllers/links_controller.rb

INSERT INTO "links" ("user_id", "title", "url", "created_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["title", "hello"], ["url", "world"], ["created_at", "2023-06-07 17:18:19.536108"]]
---
    def create
        @link = Link.new(link_params)

        if @link.save