backend/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "password") VALUES ($1, $2, $3) RETURNING "id"  [["name", "user"], ["email", "usser@gmail.com"], ["password", "[FILTERED]"]]